src/cf/Catalogs/КлючиАдресовЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлючиАдресовЗЕРНО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАдреса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОператорыАдреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКонтрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СкладКонтрагентЗЕРНО</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/КлючиАдресовЗЕРНО/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		
		Заголовок     = Параметры.ЗаголовокФормы;
		АвтоЗаголовок = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	МассивКлючейАдресов = Строки.ПолучитьКлючи();
	СопоставлениеКлючей = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КлючиАдресовЗЕРНООператорыАдреса.Ссылка          КАК КлючАдреса,
		|	КлючиАдресовЗЕРНООператорыАдреса.СкладКонтрагент КАК СкладКонтрагент
		|ИЗ
		|	Справочник.КлючиАдресовЗЕРНО.ОператорыАдреса КАК КлючиАдресовЗЕРНООператорыАдреса
		|ГДЕ
		|	КлючиАдресовЗЕРНООператорыАдреса.Ссылка В (&МассивСсылок)
		|ИТОГИ
		|ПО
		|	КлючАдреса";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивКлючейАдресов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКлючАдреса = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКлючАдреса.Следующий() Цикл
		
		МассивСопоставленийПоКлючу = Новый Массив;
		ВыборкаДетальныеЗаписи = ВыборкаКлючАдреса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
			МассивСопоставленийПоКлючу.Добавить(ВыборкаДетальныеЗаписи.СкладКонтрагент);
		КонецЦикла;
		
		СопоставлениеКлючей.Вставить(ВыборкаКлючАдреса.КлючАдреса, МассивСопоставленийПоКлючу);
		
	КонецЦикла;
	
	Для Каждого СтрокаДанных Из Строки Цикл
		
		ДанныеСтроки        = СтрокаДанных.Значение.Данные;
		ДанныеСопоставлений = СопоставлениеКлючей.Получить(СтрокаДанных.Ключ);
		
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "Сопоставление") Тогда
			Прервать;
		КонецЕсли;
		
		Если ДанныеСопоставлений = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеСопоставлений.Количество() = 1 Тогда
			ПредставлениеСопоставления = ДанныеСопоставлений[0];
		Иначе
			
			ШаблонСтроки = НСтр("ru = '%1 ( + еще %2 )'");
			ПредставлениеСопоставления = СтрШаблон(ШаблонСтроки, Строка(ДанныеСопоставлений[0]), ДанныеСопоставлений.Количество() - 1);
			
		КонецЕсли;
		
		ДанныеСтроки.Сопоставление = ПредставлениеСопоставления;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
